# BeamBelongsTo Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..BeamBelongsTo Method
BeamSystem Class See Also
---
Find out the BeamSystem to which the beam belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static BeamSystem BeamBelongsTo(
	FamilyInstance beam
)
```

Visual Basic
---
```text
Public Shared Function BeamBelongsTo ( _
	beam As FamilyInstance _
) As BeamSystem
```

Visual C++
---
```text
public:
static BeamSystem^ BeamBelongsTo(
	FamilyInstance^ beam
)
```

# ### Parameters
beam
    Type: Autodesk.Revit.DB..::..FamilyInstanceThe beam want to ask.
# ### Return Value
The BeamSystem.
# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace